{
    "sample": {
        "id": "示例ID",
        "title": "示例标题",
        "time": "1970/1/1",
        "class": [
            "长文章",
            "随笔杂谈",
            "时事评论",
            "开发记录",
            "美文导读"
        ],
        "body": "<p>示例正文。</p>"
    },
    "data": [
        {
            "id": "2022-ending-summary",
            "title": "为了所热爱的一切",
            "time": "2023/1/21",
            "class": "长文章",
            "body": "<p>有的人天生就是有很强的表达欲。我也有，但是我无法表达。</p><p>这种信息，我不明白怎么告诉别人。要么就是别人听不懂，要么就是我说不清。我时常睁着眼幻想着这种抽象的信息结构，像摆弄积木的孩童般。但是这种“积木”，只有我才能“看见”。由此，我常与同龄人有很大的代沟。</p><p>童年时期，由于严苛的家教，我基本上没有什么爱好。对于时兴的娱乐项目，几乎一无所知。我依稀记得，小学最后一年的某天，我碰巧与班长放学一起回家，他路过小卖部顺手买了个陀螺，我手里攥着硬币，却买了本漫画书。很显然，这两种物品没有什么联系。于是很快我就变成了一个人，走在路上。那时候，我发现我好孤独，明明大家都是相互认识的，明明我也有好好学习的，但是总是没法和大家玩到一起。</p><p>又一次的，我爬上了高处，失望的眺望远处。那时候，小区里外总是有很多荒凉的高处，我没事的时候就喜欢逛逛这些不受人待见的地方。小时候的“孩子王”，现在被迫变成哑巴一样的人。这是如何的一种变化呢？我年龄太小，没法回答，只是继续眺望着，看着天色逐渐暗淡，等着晚上妈妈下班回来，好能开口讨一份温热气。</p><p>后来我接触了批判主义、反叛主义，它们像磨刀石一样，无声打磨我的眼光和心。有了一眼看清人的资本，我才发现我其实是一个很能干事的人。渐渐的，我开始从自卑和闭塞中走出来，拥抱形形色色的人。但在多年的从商中，我也变成了曾经自己讨厌的样子：变得冷血、没有同情心；金钱亦麻痹了我的心灵，没人能劝服我。</p><p>几年后，我遇到了一位挚友，他使我最终清醒过来。我开始思考金钱于我的意义，以及我人生的终极追求。在我早期的构想中，我想做一位对社会有用的人，通过实业或者先进技术，为普罗大众带来福祉，这是往大了说，算是达则兼济天下。要是“穷”了，那就好好独善其身，绝不求助于、拖累任何人。可我究竟是要做什么的一项事业的呢？我阅历太浅，没法回答，只是伏在课桌上，看着没过头的书本，等着高考后的那一天，好能真正为了自己所爱的而奋斗。</p><p>2020年，COVID-19病毒席卷全球，封闭的政策使我意识到实体经济天生具有不可靠性。一旦遭遇天灾，基本上就要遭受毁灭性的打击。唯一好好生存下来的，只剩下公务员们，和一些特殊行业的人员。也因为此，我身边很多的人都选择了进军教育行业，打算入编捧铁饭碗。可是我却不敢苟同，因为我觉得当老师没法施展我的抱负。尽管这份工作也足够体面，绝对能“穷则独善其身”，但是很难“达则兼济天下”。我不希望我的人生还没泛起一丝波澜，就一眼望见了对岸。</p><p>可我仍在摇摆着，直到在空军招飞中因过重而被淘汰。母亲说，当飞行员也是很好的。无论是进部队，还是进入民航公司，都很体面。钱，大把大把的拿；待遇，一辈子吃喝不愁。可是我已经不再对钱感兴趣，也不对所谓的“稳定”和“光鲜”有想法。这次失败，正好，奠定我极具冒险性的人生的开端。</p><p>填报志愿时，我仔细端详着花名册上的院校和专业，父亲在一旁叽叽喳喳，我想办法平静下来自己，暗自捉摸着。最大的问题是我根本不知道我喜欢什么，虽然相对于其他人已经是瘸子里挑将军了。可是我还是拿不定主意，也不好掂量这一次抉择的厚重性。</p><p>“他们都报的什么专业呢？”</p><p>可是没有人会专门宣传自己的选择，我也不好意思去问。直到最后一次，我走进学校的机房，所有人都在紧张的填报着志愿，我才略知一二别人的方向。五花八门的，有语言、教育、经济、机械什么的，让人头晕眼花。坐下来，我面对着眼前这台电脑，我呆滞住了。回望这么多年以来，我不知道哪个爱好能成为将来吃饭的玩意。最终，我选择把赌注押在CS（计算机科学）上。一个像我这样的人，刚认事家里的电脑就被送人，直到高中前还几乎对电脑一无所知；但又是一个像我这样的人，刚上高中就买了一台属于自己的笔记本电脑（用到现在），卖了那么多年的软件服务和硬件，真正做到了用爱好赚钱。</p><p>于是我按下确定。</p><p>在我的构想中，如果我顺利进入CS专业，那自然是万事大吉；如果被调剂，那我就要想办法转专业。为了防止转专业前浪费至少一整个学期，我所有槽位填的都是CS类的专业，清一色的，亮眼极了。</p><p>最后不出所料，没有进入CS，进入了另一个相关的专业。但其前期课程和CS一模一样，转起来没有任何损失。平常在学校里，我努力学习专业课，希望尽快达成我的愿望——用独立项目为自己在市场上站稳脚跟打好基础。大一一整年，我的样子终于成为父母曾最爱的样子：老老实实的坐在那里，一学一整天。但是，我也因此失去了许多，至今我仍感到遗憾。</p><p>可为了所热爱的一切，我甘愿放弃其他所有。国庆节的躁动，抚不动我的心；圣诞节的情热，拉不走我的心思；哪怕是春节的热闹，都不再与我有关。当我坐下思考的时候，我发觉灵感能像黄河一般汹涌，涌上我的指尖，驱动着它们在键盘上“啪嗒啪嗒”。有时候连续十几个小时的工作后，我会开心的跳起来，开心着又解决一个问题。从CS中，我真正发现了我的爱好。</p><p>后来，随着技术不断长进，我感觉我距离愿望成真越来越近。学校里教的已经无法满足我的需求，我必须自主加修现在市场上流行的技术，以满足日益膨胀的表达欲。是的，这时我终于知道我的语言是什么语言：是能与机器“共鸣”的语言。很快的，我也达到了参与一些低级赛事的水平。但是我不想把时间浪费在沽名钓誉上，而是真正做一些有意义的实事。</p><p>大家来学CS，是为了什么呢？大部分无非是为了就业、为了赚钱。可我不在乎我以后的生活，我希望能用自己的力量推动社会进步。因为我一直认为此刻我是真正的共产主义斗士，我希望不为资本家服务、剥削劳动人民，而是使用技术造福人民，使普罗大众享受到科技带来的便利。我热爱它，我也能理解它，这时候我相信我有本事“达则兼济天下”——凭借着这股劲头。</p><p>尽管我是备受争议的，是受尽嘲笑的，可我已经没有了顾虑的精力。我想用我的“笔”，写出我的想法，给到所有的人来看、来证明：人，从来就不必被打上“普通”、“平凡”的标签，纵使是“普通人”，也有义务和能力对社会作出贡献。</p><p>身处寅虎年的最后一天，我满怀激情的写下本文。希望多年之后再回顾，那时我没有忘记我的本心、没有被生活打磨掉斗争的意志，仍是一个满腔热血的人。</p>"
        },
        {
            "id": "pb-ready",
            "title": "Penyo Blog 即将正式上线！",
            "time": "2023/1/17",
            "class": "随笔杂谈",
            "body": "<p>Penyo Blog 将于2023年1月17日正式上线！这个项目从半年前悄然立项，到今年1月中旬初正式启动开发，中间对其定位和功能的打磨耗时不菲。我把这个博客定义为大号的“QQ空间”，在这儿延续我真正的内在精神。</p><p>我之前有个用了十年的QQ号，因为空间评论了腾讯的美国爹，号被永久封禁。我说实话，我很无语。因为我说的都是事实，对于每一个中国人来说也几乎都是能理解认可的。但是这种内容就是所谓的“敏感”。甭管你对不对，反正就是不能讨论。这就是国内的舆论环境：想涉政，你必须吹捧执政党，至于其他的，你得看上面的脸色。因此说，中国人是没有所谓的言论自由的，这一点，我相信谁都不能否认。</p><p>所以，我很高兴我建立起来了属于自己的博客。这一刻，我终于不需要再看任何人的脸色，也不用再关心会不会因为语言太尖锐而被恶意举报，然后被中专审核删掉。这世界上那么多人，我没有耐心和怜悯心去了解他们那无所谓的搞笑感受。我只想看到真相、说出真相、挥剑斩向黑暗。当然，对于博客，我也能料想到一种结局。有的人，他天生就是汉奸。他不能容忍你针砭时弊，于是使出各种各样的阴招，向有关部门举报算轻的了，重的直接网上开喷、报警。那么对于这种人，我只能说，你要是真的爱国者，你就要有为了更光明的未来的中国而能付出一切的决心，如果你想成为却没有勇气成为，请不要嘲讽那些仍在努力的人，哪怕是微不足道的。</p><p>虽然在这里没有谁来监管，我也不至于过于放纵。因为我知道作为一个人、一个中国人该有什么立场，那当然是客观看待事物、勇敢揭开伤疤，让国家变得更好。其次，我在博客上，也不至于总发时事评论，还有很多生活中的、专业中的、文学中的事情，等待我去探索。因为我首先是一个百姓，其次才是一个“记者”。</p><p>人，为什么具有差异性？不仅仅是外表不一样，更重要的是内在，是思考。一个没有思考的人，一个随大流的人，他是不会有很大的成就的。跳出圈套、打破规矩，才是我们应有的态度。</p><p>技术方面，网站的传统三件套全部独立编写，真正做到对代码结构了如指掌，便于随时调整。服务器和域名什么的，都不用我操心，这免去了麻烦的国内监管。以后技术更好了、经济条件更宽裕了，我会乖乖租个域名和独立服务器的。现在没那么多条件，自然也就整不了太多花活。能搞了，第一时间当然是做出来评论、站内信、用户系统等功能，敬请期待。</p>"
        }
    ]
}